#include "include.h"

/***************************************************************************************
  * @说明  	初始化函数
  *	@参数	无
  * @返回值 无
  * @注		无
***************************************************************************************/
void SystemInit(void)
{
/***********************************WDT配置初始化**************************************/
	WDTC = 0x54;						//允许WDT复位，允许掉电/空闲模式下运行，128分频
	WDTCCR = 0xFF;					//写入00时，将关闭WDT功能（但不关闭内部低频RC），745ms	
/************************************系统初始化****************************************/
	CLKSWR = 0x50;						//选择内部高频RC为系统时钟，内部高频RC 1分频，Fosc=32MHz
	CLKDIV = 0x02;						//Fosc 2分频得到Fcpu，Fcpu=16MHz 
	FREQ_CLK=0x10;           //设定当前系统时钟 Fcpu=16MHz	
/**********************************相关配置初始化**************************************/
//	P0M2 = 0x32;				    //P04设置为上拉输入
		P0M1 = 0x03;				    //P03设置为输入
/**********************************TIM1配置初始化**************************************/	
	TCON1 = 0x00;						//T1定时器时钟为Fosc,Fosc=32MHz,12分频
	TMOD = 0x00;						//16位重装载定时器/计数器
	TH1 = 0xF5;
	TL1 = 0x96;							//T1定时时间1ms
	ET1=1;
	TR1=0;
	LVDC &=~ 0x08;					//清除LVD中断标志位 	
}